{
  "name": "Project Drishti - Smart Crowd Management",
  "description": "An AI-  dashboard for real-time crowd monitoring, risk prediction, and stampede prevention for major pilgrimage sites like Somnath, Dwarka, and Ambaji. Additionally, includes an AI-Driven Predictive Collision Prevention System for Smart Intersections: This idea proposes an AI-driven predictive traffic safety framework designed specifically for high-risk T-junctions and crossroad intersections, where conventional traffic control mechanisms often fail to prevent sudden collisions. The system integrates computer vision–enabled CCTV infrastructure with intelligent STOP LED signaling, forming a real-time, autonomous collision prevention layer within existing road networks. Unlike traditional traffic lights or static warning signs, the proposed system employs continuous multi-directional traffic monitoring using advanced AI models capable of trajectory prediction, speed estimation and collision probability assessment. When the system identifies two or more vehicles approaching an intersection with a high likelihood of conflict, it dynamically triggers real-time visual alerts via blinking STOP LEDs, enabling early driver intervention and significantly reducing reaction latency. The STOP LED indicators operate on a graded warning protocol, wherein alert intensity is dynamically adjusted based on vehicle speed and estimated collision severity. Moderate-risk scenarios activate orange alerts, while red alerts indicate imminent or high-impact collision probability. This color-coded severity mapping aligns with human cognitive response patterns, ensuring intuitive and rapid driver comprehension. In parallel, the system maintains forensic-grade data acquisition, capturing vehicle speed profiles and automated number plate recognition (ANPR). In post-incident scenarios, this data facilitates objective accident reconstruction, responsibility attribution and legal accountability, thereby strengthening traffic governance and enforcement mechanisms. Furthermore, the same dataset can be leveraged for automated overspeeding detection, contributing to proactive traffic discipline without continuous human surveillance. This idea contributes toward the vision of human-centric smart cities, where AI systems do not merely regulate traffic flow but actively prevent loss of life through predictive intelligence. By transforming passive intersections into cognitively aware safety nodes, the proposed system demonstrates a scalable, cost-effective and ethically aligned application of Artificial Intelligence for advancing road safety and public welfare.",
  "requestFramePermissions": [
    "camera"
  ]
}
